УТ_для_edt.РасширениеСмарт/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/СборкаТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура смарт_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.СборкаТоваров.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ЗаказыСервер.ОтразитьЗаказыНаСборку(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьДатыПоступленияТоваровОрганизаций(ДополнительныеСвойства, Отказ);
	ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);

	ЗапасыСервер.ОтразитьТоварыОрганизацийКПередаче(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьТоварыКОформлениюОтчетовКомитента(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьДвижениеТоваров(ДополнительныеСвойства, Движения, Отказ);
	СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	ПартионныйУчетСервер.ОтразитьПартииТоваровОрганизаций(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
	// Движения по оборотным регистрам управленческого учета 
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияНоменклатураНоменклатура(ДополнительныеСвойства, Движения, Отказ);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	смартСборкаРазборкаОборудованияСервер.ОтразитьЗаявкиНаРазборкуОборудования(ДополнительныеСвойства, Движения, Отказ);
	смартСборкаРазборкаОборудованияСервер.ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);

	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();

	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.Проведение);

	СборкаТоваровЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов();
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ,, Ссылка);
	КонецЕсли;
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаУдаленияПроведения")
Процедура смарт_ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ЗапасыСервер.ПодготовитьЗаписьТоваровОрганизаций(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения);

	СборкаТоваровЛокализация.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов();
	ПараметрыЗаполнения.ДокументДелаетИПриходИРасход = Ложь;
	ЗапасыСервер.СформироватьРезервыПоТоварамОрганизаций(ЭтотОбъект, Отказ, ПараметрыЗаполнения);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	#Вставка
	//#Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	// отключил. Контроль переехал в общую процедуру контроля проведения
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	//смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ПроведениеСерверУТ.ЗаписатьПодчиненныеНаборамЗаписейДанные(ЭтотОбъект, Отказ);

	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Если НЕ ДополнительныеСвойства.Свойство("НеОтражатьСостояниеЗаявкиНаРазборОборудования") Тогда
		РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ, Истина, Ссылка);	
	КонецЕсли;
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки

КонецПроцедуры

//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
&ИзменениеИКонтроль("СформироватьСписокРегистровДляКонтроля")
Процедура смарт_СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	// Контроль при перепроведении и отмене проведения.
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		// Приходы в регистр (сторно расхода из регистра) контролируем при перепроведении и отмене проведения.
		Массив.Добавить(Движения.ТоварыОрганизаций);
	КонецЕсли;

	Если ЗаказНаСборку <> Документы.ЗаказНаСборку.ПустаяСсылка() // По заказу 
		Или Не ДополнительныеСвойства.ЭтоНовый Тогда
		Массив.Добавить(Движения.ТоварыКОтгрузке);
	КонецЕсли;

	Массив.Добавить(Движения.ОбеспечениеЗаказов);

	// При проведении выполняется контроль превышения свободного остатка и заказа.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Массив.Добавить(Движения.СвободныеОстатки);
		Массив.Добавить(Движения.ЗаказыНаСборку);

		ПараметрыУказанияСерий =  НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.СборкаТоваров);
		Если ПараметрыУказанияСерий.ТЧ.ИспользоватьСерииНоменклатуры
			Или ПараметрыУказанияСерий.Шапка.ИспользоватьСерииНоменклатуры Тогда

			Массив.Добавить(Движения.ТоварыНаСкладах);

		КонецЕсли;

	КонецЕсли;
	
	#Вставка
	//++ #1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования
	Массив.Добавить(Движения.смартЗаявкиНаРазборкуОборудования);
	Массив.Добавить(Движения.смартОборудованиеКРазборке);
	//-- #1901 смарт: Ермаков 21.08.2024
	#КонецВставки
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	СтруктураЗаполнения = Неопределено;
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Распоряжение = ДокументОснованиеПриЗаполнении(ДанныеЗаполнения);
	ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров(Распоряжение);

	// Заполнение по заказу(-ам).
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказов") Тогда

		СтруктураЗаполнения = ДанныеЗаполнения;
		СтруктураЗаполнения.РеквизитыШапки.Вставить("ВариантПриемкиТоваров", ВариантПриемкиТоваров);

		ЗаполнитьПоЗаказу(СтруктураЗаполнения);
		
		#Вставка
		//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
		Если ДанныеЗаполнения.МассивЗаказов.Количество() > 0 Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения.МассивЗаказов[0]));
			Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
					ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.МассивЗаказов[0].смартЗапчастиГарантийные;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//-- #Б1376 смарт: Шляпников 19.11.2024
		#КонецВставки

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПроизводственнаяОперацияВЕТИС") Тогда

		ИнтеграцияВЕТИСУТ.ЗаполнитьСборкуТоваровНаОснованииПроизводственнойОперацииВЕТИС(ЭтотОбъект, ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда

		ИнтеграцияИСМПУТ.ЗаполнитьСборкуТоваровНаОснованииМаркировкиТоваровИСМП(ЭтотОбъект, ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыводИзОборотаИСМП") Тогда

		ИнтеграцияИСМПУТ.ЗаполнитьСборкуТоваровНаОснованииВыводаИзОборотаИСМП(ЭтотОбъект, ДанныеЗаполнения);

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	СборкаТоваровЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);

	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДанныеЗаполнения));
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", ОбъектМетаданных) Тогда
			ЭтотОбъект.смартЗапчастиГарантийные = ДанныеЗаполнения.смартЗапчастиГарантийные;
		КонецЕсли;
	КонецЕсли;
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ЗаказыСервер.ПроверитьДатуРаспоряжения(ЭтотОбъект);
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	ПараметрыОкругления = ОбщегоНазначенияУТ.ПараметрыОкругленияКоличестваШтучныхТоваров();
	ПараметрыОкругления.ИмяТЧ = "Объект";
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления);

	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	// Очистка неиспользуемых реквизитов в тч Товары
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		Для Каждого Товар Из Товары Цикл
			Если Товар.ДоляСтоимости <> 0 Тогда
				Товар.ДоляСтоимости = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПараметрыСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.СборкаТоваров);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыСерий);

	// Заполнение видов запасов.
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		ЗаполнитьАналитикиУчетаНоменклатуры();
		ЗаполнитьВидыЗапасов(Отказ);

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда

		Если Не ВидыЗапасовУказаныВручную Тогда
			ВидыЗапасовСписание.Очистить();
			ВидыЗапасовОприходование.Очистить();
		КонецЕсли;

	КонецЕсли;

	СборкаТоваровЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	#Вставка
	//++ #Б2934 смарт: Шляпников 01.04.2025 / Заявка на разборку оборудования. Дополнение. Последующие разборки.
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаСборку) 
		И ЗначениеЗаполнено(ЭтотОбъект.ЗаказНаСборку.ДокументОснование) 
		И ТипЗнч(ЭтотОбъект.ЗаказНаСборку.ДокументОснование) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования")
		И ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
		ЭтотОбъект.Назначение = ЭтотОбъект.ЗаказНаСборку.Назначение;
	КонецЕсли;
	//-- #Б2934 смарт: Шляпников 01.04.2025
	#КонецВставки

КонецПроцедуры

#КонецОбласти

#КонецЕсли
